[SwordSlice X2AbilityTemplate]
LocLongDescription="Attack any enemy within movement range with your melee weapon."
LocHelpText="Attack an enemy within movement range with your melee weapon."

[PairedPistol_CV X2PairedWeaponTemplate]
FriendlyName="Utility Pistol"
FriendlyNamePlural="Utility Pistols"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."

[PairedPistol_MG X2PairedWeaponTemplate]
FriendlyName="Utility Mag Pistol"
FriendlyNamePlural="Utility Mag Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."

[PairedPistol_BM X2PairedWeaponTemplate]
FriendlyName="Utility Beam Pistol"
FriendlyNamePlural="Utility Beam Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Beam pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."

[PairedSword_CV X2PairedWeaponTemplate]
FriendlyName="Utility Sword"
FriendlyNamePlural="Utility Swords"
BriefSummary="XCOM Rangers train in the use of edged weapons, enabling them to take out enemies in close combat."
TacticalText="<Bullet/> Rangers can attack adjacent enemies with their sword even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="sword"

[PairedSword_MG X2PairedWeaponTemplate]
FriendlyName="Utility Arc Blade"
FriendlyNamePlural="Utility Arc Blades"
BriefSummary="When pure kinetic energy is no longer sufficient in the field, the Arc Blade may prove necessary. It boosts the standard Sword's combat effectiveness with the addition of an electric field, capable of stunning enemies that are not killed outright."
TacticalText="<Bullet/> The Arc Blade adds a powerful electric burst to the sword's kinetic impact, improving its damage and adding a chance to stun enemy targets."
AbilityDescName="sword"

[PairedSword_BM X2PairedWeaponTemplate]
FriendlyName="Utility Fusion Blade"
FriendlyNamePlural="Utility Fusion Blades"
BriefSummary="The Fusion Blade encases a plasma-heated metallic core in a micro-thin magnetic field, enabling devastating melee attacks that are capable of setting enemies aflame."
TacticalText="<Bullet/> This is the most advanced version of the Ranger's sword, dealing maximum damage with a chance to burn enemy targets."
AbilityDescName="sword"

[PairedGremlin_CV X2PairedWeaponTemplate]
FriendlyName="Utility GREMLIN"
FriendlyNamePlural="Utility GREMLINS"
BriefSummary="The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances."
TacticalText="<Bullet/> The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances.\n<Bullet/> The GREMLIN accompanies the Specialist, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> The GREMLIN generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."

[PairedGremlin_MG X2PairedWeaponTemplate]
FriendlyName="Utility GREMLIN Mark II"
FriendlyNamePlural="Utility GREMLIN Mark II"
BriefSummary="The Mark II GREMLIN is an improved version of the standard GREMLIN Drone. Not only will it greatly increase the hacking stat of our Specialists, but many Specialist abilities improve their effectiveness when the GREMLIN becomes more advanced."
TacticalText="<Bullet/> The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances.\n<Bullet/> The GREMLIN accompanies the Specialist, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> The GREMLIN generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."

[PairedGremlin_BM X2PairedWeaponTemplate]
FriendlyName="Utility GREMLIN Mark III"
FriendlyNamePlural="Utility GREMLIN Mark III"
BriefSummary="The Mark III GREMLIN is the most advanced version of the GREMLIN Drone, significantly increasing the hacking stat of all Specialists. The Specialist's abilities are also substantially improved when he or she is accompanied by this support robot."
TacticalText="<Bullet/> The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances.\n<Bullet/> The GREMLIN accompanies the Specialist, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> The GREMLIN generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."

[PairedGrenadeLauncher_CV X2PairedWeaponTemplate]
FriendlyName="Utility Grenade Launcher"
FriendlyNamePlural="Utility Grenade Launchers"
BriefSummary="A Grenade Launcher allows the Grenadier to launch Grenades much further than other soldiers, and increase the radius of their explosive attacks."
TacticalText="<Bullet/> The grenade launcher is the Grenadier's specialty weapon.\n<Bullet/> It has a substantially increased range relative to throwing.\n<Bullet/> Grenadiers can train several abilities that enhance their use of the Grenade Launcher."

[PairedGrenadeLauncher_MG X2PairedWeaponTemplate]
FriendlyName="Utility Advanced Grenade Launcher"
FriendlyNamePlural="Utility Advanced Grenade Launchers"
BriefSummary="Our Advanced Grenade Launcher uses magnetic technology to propel grenades further than our conventional launcher, and grants a larger effect radius to any launched projectiles."
TacticalText="<Bullet/> The Advanced Grenade Launcher has an increased range and explosive radius over the standard Grenade Launcher.\n."

[UtilityPistol_CV X2WeaponTemplate]
FriendlyName="Pistol"
FriendlyNamePlural="Pistols"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."

[UtilityPistol_MG X2WeaponTemplate]
FriendlyName="Mag Pistol"
FriendlyNamePlural="Mag Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."

[UtilityPistol_BM X2WeaponTemplate]
FriendlyName="Beam Pistol"
FriendlyNamePlural="Beam Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Beam pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."

[UtilitySword_CV X2WeaponTemplate]
FriendlyName="Sword"
FriendlyNamePlural="Swords"
BriefSummary="XCOM Rangers train in the use of edged weapons, enabling them to take out enemies in close combat."
TacticalText="<Bullet/> Rangers can attack adjacent enemies with their sword even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="sword"

[UtilitySword_MG X2WeaponTemplate]
FriendlyName="Arc Blade"
FriendlyNamePlural="Arc Blades"
BriefSummary="When pure kinetic energy is no longer sufficient in the field, the Arc Blade may prove necessary. It boosts the standard Sword's combat effectiveness with the addition of an electric field, capable of stunning enemies that are not killed outright."
TacticalText="<Bullet/> The Arc Blade adds a powerful electric burst to the sword's kinetic impact, improving its damage and adding a chance to stun enemy targets."
AbilityDescName="sword"

[UtilitySword_BM X2WeaponTemplate]
FriendlyName="Fusion Blade"
FriendlyNamePlural="Fusion Blades"
BriefSummary="The Fusion Blade encases a plasma-heated metallic core in a micro-thin magnetic field, enabling devastating melee attacks that are capable of setting enemies aflame."
TacticalText="<Bullet/> This is the most advanced version of the Ranger's sword, dealing maximum damage with a chance to burn enemy targets."
AbilityDescName="sword"

[UtilityGremlin_CV X2GremlinTemplate]
FriendlyName="GREMLIN"
FriendlyNamePlural="GREMLINS"
BriefSummary=""
TacticalText="<Bullet/> The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances.\n<Bullet/> The GREMLIN accompanies the Specialist, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> The GREMLIN generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."

[UtilityGremlin_MG X2GremlinTemplate]
FriendlyName="GREMLIN Mark II"
FriendlyNamePlural="GREMLIN Mark II"
BriefSummary="The Mark II GREMLIN is an improved version of the standard GREMLIN Drone. Not only will it greatly increase the hacking stat of our Specialists, but many Specialist abilities improve their effectiveness when the GREMLIN becomes more advanced."
TacticalText="<Bullet/> The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances.\n<Bullet/> The GREMLIN accompanies the Specialist, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> The GREMLIN generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."

[UtilityGremlin_BM X2GremlinTemplate]
FriendlyName="GREMLIN Mark III"
FriendlyNamePlural="GREMLIN Mark III"
BriefSummary="The Mark III GREMLIN is the most advanced version of the GREMLIN Drone, significantly increasing the hacking stat of all Specialists. The Specialist's abilities are also substantially improved when he or she is accompanied by this support robot."
TacticalText="<Bullet/> The GREMLIN Drone allows Specialists to execute a variety of battlefield tasks from safer distances.\n<Bullet/> The GREMLIN accompanies the Specialist, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> The GREMLIN generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."

[UtilityGrenadeLauncher_CV X2GrenadeLauncherTemplate]
FriendlyName="Grenade Launcher"
FriendlyNamePlural="Grenade Launchers"
BriefSummary="A Grenade Launcher allows the Grenadier to launch Grenades much further than other soldiers, and increase the radius of their explosive attacks."
TacticalText="<Bullet/> The grenade launcher is the Grenadier's specialty weapon.\n<Bullet/> It has a substantially increased range relative to throwing.\n<Bullet/> Grenadiers can train several abilities that enhance their use of the Grenade Launcher."

[UtilityGrenadeLauncher_MG X2GrenadeLauncherTemplate]
FriendlyName="Advanced Grenade Launcher"
FriendlyNamePlural="Advanced Grenade Launchers"
BriefSummary="Our Advanced Grenade Launcher uses magnetic technology to propel grenades further than our conventional launcher, and grants a larger effect radius to any launched projectiles."
TacticalText="<Bullet/> The Advanced Grenade Launcher has an increased range and explosive radius over the standard Grenade Launcher.\n."

[PairedPsiAmp_CV X2PairedWeaponTemplate]
FriendlyName="Psi Amp"
FriendlyNamePlural="Psi Amps"
BriefSummary="A Psi Amp allows Psi Operatives to perform their psionic abilities."
TacticalText="<Bullet/> A Psi Amp allows Psi Operatives to perform their psionic abilities.\n<Bullet/> More advanced Psi Amps can increase the Operative's psionic strength, and the effective ness of their abilities."

[PairedPsiAmp_MG X2PairedWeaponTemplate]
FriendlyName="Advanced Psi Amp"
FriendlyNamePlural="Advanced Psi Amps"
BriefSummary="This evolved version of the Psi Amp channels the user's Psionic energy far more clearly, enabling greater psionic strength in our operatives. Psi Offense and psionic attack damage of some abilities is improved when carrying this advanced amplifier."
TacticalText="<Bullet/> The Advanced Psi Amp increases a Psi Operative's psionic strength by +20.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.\n<Bullet/> The Advanced Psi Amp also increases the damage done by many psionic attacks.\n"

[PairedPsiAmp_BM X2PairedWeaponTemplate]
FriendlyName="Alien Psi Amp"
FriendlyNamePlural="Alien Psi Amps"
BriefSummary="This version of the Psionic Amplifier incorporates artifacts from the powerful \"Gatekeeper\" alien we encountered. It will put our experienced Psi Operatives on the same level as the aliens' most powerful Psionic forces."
TacticalText="<Bullet/> A Psi Amp increases a Psi Operative's psionic strength by +40.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.<Bullet/> The Alien Psi Amp also increases the damage done by many psionic attacks.\n"

[UtilityPsiAmp_CV X2WeaponTemplate]
FriendlyName="Psi Amp"
FriendlyNamePlural="Psi Amps"
BriefSummary="A Psi Amp allows Psi Operatives to perform their psionic abilities."
TacticalText="<Bullet/> A Psi Amp allows Psi Operatives to perform their psionic abilities.\n<Bullet/> More advanced Psi Amps can increase the Operative's psionic strength, and the effective ness of their abilities."

[UtilityPsiAmp_MG X2WeaponTemplate]
FriendlyName="Advanced Psi Amp"
FriendlyNamePlural="Advanced Psi Amps"
BriefSummary="This evolved version of the Psi Amp channels the user's Psionic energy far more clearly, enabling greater psionic strength in our operatives. Psi Offense and psionic attack damage of some abilities is improved when carrying this advanced amplifier."
TacticalText="<Bullet/> The Advanced Psi Amp increases a Psi Operative's psionic strength by +20.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.\n<Bullet/> The Advanced Psi Amp also increases the damage done by many psionic attacks.\n"

[UtilityPsiAmp_BM X2WeaponTemplate]
FriendlyName="Alien Psi Amp"
FriendlyNamePlural="Alien Psi Amps"
BriefSummary="This version of the Psionic Amplifier incorporates artifacts from the powerful \"Gatekeeper\" alien we encountered. It will put our experienced Psi Operatives on the same level as the aliens' most powerful Psionic forces."
TacticalText="<Bullet/> A Psi Amp increases a Psi Operative's psionic strength by +40.\n<Bullet/> Psi Strength determines the potency of many of your psychic abilities.<Bullet/> The Alien Psi Amp also increases the damage done by many psionic attacks.\n"
